/********************************************************************************************

## 1 钢条切割

### 题目描述

#### 给定一个二维数组表示长度为i英寸的钢条价格pi
####    长度i   1   2   3   4   5   6   7   8   9   10
####    价格pi  1   5   8   9   10  17  17  20  24  30
####    
####    求切割长度的方案，使得销售收益rn最大。


********************************************************************************************/

#include <iostream>

using namespace std;
int steal_cutting(int n, int *table);
int main()
{
    int lenght_price_table[2][10] = {{1, 2, 3, 4, 5, 6, 7, 8, 9, 10},
                                     {1, 5, 8, 9, 10, 17, 17, 20, 24, 30}};

    return 0;
}

int steal_cutting(int n, int *table)
{
}